'''
Задача 2 «Площадь прямоугольного треугольника»

Напишите программу, которая считывает длины двух катетов
в прямоугольном треугольнике и выводит его площадь.
Каждое число записано в отдельной строке.

S = 0.5 * b * h

'''

b = int(input())
h = int(input())
S = 0.5 * b * h
print(S)
